module.exports = {
    ERROR_CODE: {
        '101': '缺少必填的参数，出现这个情况还可能是et的值和实际加密方式不对应',
        '102': '不支持的语言类型',
        '103': '翻译文本过长',
        '104': '不支持的API类型',
        '105': '不支持的签名类型',
        '106': '不支持的响应类型',
        '107': '不支持的传输加密类型',
        '108': 'appKey无效',
        '109': 'batchLog格式不正确',
        '201': '解密失败，可能为DES,BASE64,URLDecode的错误',
        '202': '签名检验失败',
        '301': '辞典查询失败',
        '302': '小语种查询失败',
        '303': '服务端的其它异常',
        '401': '账户已经欠费',
    },
    TYPE: {
        CN: 'zh-CHS',
        JA: 'ja',
        EN: 'EN',
    },
}